#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/edenmind/openarabic/runs/run-U2eTGbpfp9KaFEwd

Waiting for the plan to start...

Terraform v1.2.3
on linux_amd64
Initializing plugins and modules...
data.digitalocean_kubernetes_cluster.openarabic: Reading...
digitalocean_kubernetes_cluster.openarabic: Refreshing state... [id=77075ba0-95ba-4b48-af02-749d1566c548]
digitalocean_container_registry.repository: Refreshing state... [id=openarabic]
data.digitalocean_kubernetes_cluster.openarabic: Read complete after 1s [id=77075ba0-95ba-4b48-af02-749d1566c548]
helm_release.istio-base: Refreshing state... [id=istio-base]
helm_release.istio-istiod: Refreshing state... [id=istio-istiod]
helm_release.istio-ingress: Refreshing state... [id=istio-ingress]
helm_release.loadtester: Refreshing state... [id=loadtester]
helm_release.flagger: Refreshing state... [id=flagger]
helm_release.metrics-server: Refreshing state... [id=metrics-server]
kubernetes_namespace.openarabic: Refreshing state... [id=openarabic]
kubernetes_namespace.loadtester: Refreshing state... [id=loadtester]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # digitalocean_kubernetes_cluster.openarabic will be updated in-place
  ~ resource "digitalocean_kubernetes_cluster" "openarabic" {
        id             = "77075ba0-95ba-4b48-af02-749d1566c548"
        name           = "openarabic"
        tags           = []
        # (14 unchanged attributes hidden)


      ~ node_pool {
            id                = "0d1e6158-e8d0-4fd1-bb77-cb08d1e8b842"
            name              = "worker-pool"
          ~ node_count        = 3 -> 2
            tags              = []
            # (7 unchanged attributes hidden)
        }
        # (1 unchanged block hidden)
    }

  # helm_release.flagger will be destroyed
  # (because helm_release.flagger is not in configuration)
  - resource "helm_release" "flagger" {
      - atomic                     = false -> null
      - chart                      = "flagger" -> null
      - cleanup_on_fail            = false -> null
      - create_namespace           = true -> null
      - dependency_update          = false -> null
      - disable_crd_hooks          = false -> null
      - disable_openapi_validation = false -> null
      - disable_webhooks           = false -> null
      - force_update               = false -> null
      - id                         = "flagger" -> null
      - lint                       = false -> null
      - max_history                = 0 -> null
      - metadata                   = [
          - {
              - app_version = "1.21.0"
              - chart       = "flagger"
              - name        = "flagger"
              - namespace   = "istio-system"
              - revision    = 1
              - values      = jsonencode(
                    {
                      - clusterName   = "openarabic"
                      - meshProvider  = "istio"
                      - metricsServer = "http://prometheus.istio-system:9090"
                      - namespace     = "openarabic"
                      - slack         = {
                          - channel = "general"
                          - url     = "https://hooks.slack.com/services/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"
                          - user    = "flagger"
                        }
                    }
                )
              - version     = "1.21.0"
            },
        ] -> null
      - name                       = "flagger" -> null
      - namespace                  = "istio-system" -> null
      - recreate_pods              = false -> null
      - render_subchart_notes      = true -> null
      - replace                    = false -> null
      - repository                 = "https://flagger.app" -> null
      - reset_values               = false -> null
      - reuse_values               = false -> null
      - skip_crds                  = false -> null
      - status                     = "deployed" -> null
      - timeout                    = 300 -> null
      - verify                     = false -> null
      - version                    = "1.21.0" -> null
      - wait                       = true -> null
      - wait_for_jobs              = false -> null

      - set {
          - name  = "clusterName" -> null
          - value = "openarabic" -> null
        }
      - set {
          - name  = "meshProvider" -> null
          - value = "istio" -> null
        }
      - set {
          - name  = "metricsServer" -> null
          - value = "http://prometheus.istio-system:9090" -> null
        }
      - set {
          - name  = "namespace" -> null
          - value = "openarabic" -> null
        }
      - set {
          - name  = "slack.channel" -> null
          - value = "general" -> null
        }
      - set {
          - name  = "slack.url" -> null
          - value = "https://hooks.slack.com/services/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" -> null
        }
      - set {
          - name  = "slack.user" -> null
          - value = "flagger" -> null
        }
    }

  # helm_release.istio-base will be destroyed
  # (because helm_release.istio-base is not in configuration)
  - resource "helm_release" "istio-base" {
      - atomic                     = false -> null
      - chart                      = "base" -> null
      - cleanup_on_fail            = false -> null
      - create_namespace           = true -> null
      - dependency_update          = false -> null
      - disable_crd_hooks          = false -> null
      - disable_openapi_validation = false -> null
      - disable_webhooks           = false -> null
      - force_update               = false -> null
      - id                         = "istio-base" -> null
      - lint                       = false -> null
      - max_history                = 0 -> null
      - metadata                   = [
          - {
              - app_version = "1.14.0"
              - chart       = "base"
              - name        = "istio-base"
              - namespace   = "istio-system"
              - revision    = 1
              - values      = "null"
              - version     = "1.14.0"
            },
        ] -> null
      - name                       = "istio-base" -> null
      - namespace                  = "istio-system" -> null
      - recreate_pods              = false -> null
      - render_subchart_notes      = true -> null
      - replace                    = false -> null
      - repository                 = "https://istio-release.storage.googleapis.com/charts" -> null
      - reset_values               = false -> null
      - reuse_values               = false -> null
      - skip_crds                  = false -> null
      - status                     = "deployed" -> null
      - timeout                    = 300 -> null
      - verify                     = false -> null
      - version                    = "1.14.0" -> null
      - wait                       = true -> null
      - wait_for_jobs              = false -> null
    }

  # helm_release.istio-ingress will be destroyed
  # (because helm_release.istio-ingress is not in configuration)
  - resource "helm_release" "istio-ingress" {
      - atomic                     = false -> null
      - chart                      = "gateway" -> null
      - cleanup_on_fail            = false -> null
      - create_namespace           = true -> null
      - dependency_update          = false -> null
      - disable_crd_hooks          = false -> null
      - disable_openapi_validation = false -> null
      - disable_webhooks           = false -> null
      - force_update               = false -> null
      - id                         = "istio-ingress" -> null
      - lint                       = false -> null
      - max_history                = 0 -> null
      - metadata                   = [
          - {
              - app_version = "1.14.0"
              - chart       = "gateway"
              - name        = "istio-ingress"
              - namespace   = "istio-system"
              - revision    = 1
              - values      = "null"
              - version     = "1.14.0"
            },
        ] -> null
      - name                       = "istio-ingress" -> null
      - namespace                  = "istio-system" -> null
      - recreate_pods              = false -> null
      - render_subchart_notes      = true -> null
      - replace                    = false -> null
      - repository                 = "https://istio-release.storage.googleapis.com/charts" -> null
      - reset_values               = false -> null
      - reuse_values               = false -> null
      - skip_crds                  = false -> null
      - status                     = "failed" -> null
      - timeout                    = 300 -> null
      - verify                     = false -> null
      - version                    = "1.14.0" -> null
      - wait                       = true -> null
      - wait_for_jobs              = false -> null
    }

  # helm_release.istio-istiod will be destroyed
  # (because helm_release.istio-istiod is not in configuration)
  - resource "helm_release" "istio-istiod" {
      - atomic                     = false -> null
      - chart                      = "istiod" -> null
      - cleanup_on_fail            = false -> null
      - create_namespace           = true -> null
      - dependency_update          = false -> null
      - disable_crd_hooks          = false -> null
      - disable_openapi_validation = false -> null
      - disable_webhooks           = false -> null
      - force_update               = false -> null
      - id                         = "istio-istiod" -> null
      - lint                       = false -> null
      - max_history                = 0 -> null
      - metadata                   = [
          - {
              - app_version = "1.14.0"
              - chart       = "istiod"
              - name        = "istio-istiod"
              - namespace   = "istio-system"
              - revision    = 1
              - values      = "null"
              - version     = "1.14.0"
            },
        ] -> null
      - name                       = "istio-istiod" -> null
      - namespace                  = "istio-system" -> null
      - recreate_pods              = false -> null
      - render_subchart_notes      = true -> null
      - replace                    = false -> null
      - repository                 = "https://istio-release.storage.googleapis.com/charts" -> null
      - reset_values               = false -> null
      - reuse_values               = false -> null
      - skip_crds                  = false -> null
      - status                     = "deployed" -> null
      - timeout                    = 300 -> null
      - verify                     = false -> null
      - version                    = "1.14.0" -> null
      - wait                       = true -> null
      - wait_for_jobs              = false -> null
    }

  # helm_release.loadtester will be destroyed
  # (because helm_release.loadtester is not in configuration)
  - resource "helm_release" "loadtester" {
      - atomic                     = false -> null
      - chart                      = "loadtester" -> null
      - cleanup_on_fail            = false -> null
      - create_namespace           = true -> null
      - dependency_update          = false -> null
      - disable_crd_hooks          = false -> null
      - disable_openapi_validation = false -> null
      - disable_webhooks           = false -> null
      - force_update               = false -> null
      - id                         = "loadtester" -> null
      - lint                       = false -> null
      - max_history                = 0 -> null
      - metadata                   = [
          - {
              - app_version = "0.22.0"
              - chart       = "loadtester"
              - name        = "loadtester"
              - namespace   = "loadtester"
              - revision    = 1
              - values      = "null"
              - version     = "0.22.0"
            },
        ] -> null
      - name                       = "loadtester" -> null
      - namespace                  = "loadtester" -> null
      - recreate_pods              = false -> null
      - render_subchart_notes      = true -> null
      - replace                    = false -> null
      - repository                 = "https://flagger.app" -> null
      - reset_values               = false -> null
      - reuse_values               = false -> null
      - skip_crds                  = false -> null
      - status                     = "deployed" -> null
      - timeout                    = 300 -> null
      - verify                     = false -> null
      - version                    = "0.22.0" -> null
      - wait                       = true -> null
      - wait_for_jobs              = false -> null
    }

  # helm_release.metrics-server will be destroyed
  # (because helm_release.metrics-server is not in configuration)
  - resource "helm_release" "metrics-server" {
      - atomic                     = false -> null
      - chart                      = "metrics-server" -> null
      - cleanup_on_fail            = false -> null
      - create_namespace           = true -> null
      - dependency_update          = false -> null
      - disable_crd_hooks          = false -> null
      - disable_openapi_validation = false -> null
      - disable_webhooks           = false -> null
      - force_update               = false -> null
      - id                         = "metrics-server" -> null
      - lint                       = false -> null
      - max_history                = 0 -> null
      - metadata                   = [
          - {
              - app_version = "0.6.1"
              - chart       = "metrics-server"
              - name        = "metrics-server"
              - namespace   = "metrics-server"
              - revision    = 1
              - values      = "null"
              - version     = "3.8.2"
            },
        ] -> null
      - name                       = "metrics-server" -> null
      - namespace                  = "metrics-server" -> null
      - recreate_pods              = false -> null
      - render_subchart_notes      = true -> null
      - replace                    = false -> null
      - repository                 = "https://kubernetes-sigs.github.io/metrics-server/" -> null
      - reset_values               = false -> null
      - reuse_values               = false -> null
      - skip_crds                  = false -> null
      - status                     = "deployed" -> null
      - timeout                    = 300 -> null
      - verify                     = false -> null
      - version                    = "3.8.2" -> null
      - wait                       = true -> null
      - wait_for_jobs              = false -> null
    }

  # module.helm_charts.helm_release.flagger will be created
  + resource "helm_release" "flagger" {
      + atomic                     = false
      + chart                      = "flagger"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "flagger"
      + namespace                  = "istio-system"
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://flagger.app"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "1.21.0"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "clusterName"
          + value = "openarabic"
        }
      + set {
          + name  = "meshProvider"
          + value = "istio"
        }
      + set {
          + name  = "metricsServer"
          + value = "http://prometheus.istio-system:9090"
        }
      + set {
          + name  = "namespace"
          + value = "openarabic"
        }
      + set {
          + name  = "slack.channel"
          + value = "general"
        }
      + set {
          + name  = "slack.url"
          + value = "https://hooks.slack.com/services/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"
        }
      + set {
          + name  = "slack.user"
          + value = "flagger"
        }
    }

  # module.helm_charts.helm_release.istio-base will be created
  + resource "helm_release" "istio-base" {
      + atomic                     = false
      + chart                      = "base"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "istio-base"
      + namespace                  = "istio-system"
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://istio-release.storage.googleapis.com/charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "1.14.0"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.helm_charts.helm_release.istio-ingress will be created
  + resource "helm_release" "istio-ingress" {
      + atomic                     = false
      + chart                      = "gateway"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "istio-ingress"
      + namespace                  = "istio-system"
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://istio-release.storage.googleapis.com/charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "1.14.0"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.helm_charts.helm_release.istio-istiod will be created
  + resource "helm_release" "istio-istiod" {
      + atomic                     = false
      + chart                      = "istiod"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "istio-istiod"
      + namespace                  = "istio-system"
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://istio-release.storage.googleapis.com/charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "1.14.0"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.helm_charts.helm_release.loadtester will be created
  + resource "helm_release" "loadtester" {
      + atomic                     = false
      + chart                      = "loadtester"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "loadtester"
      + namespace                  = "loadtester"
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://flagger.app"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "0.22.0"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.helm_charts.helm_release.metrics-server will be created
  + resource "helm_release" "metrics-server" {
      + atomic                     = false
      + chart                      = "metrics-server"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "metrics-server"
      + namespace                  = "metrics-server"
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://kubernetes-sigs.github.io/metrics-server/"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "3.8.2"
      + wait                       = true
      + wait_for_jobs              = false
    }

Plan: 6 to add, 1 to change, 6 to destroy.


```

</details>

*Pushed by: @YunusAndreasson, Action: `pull_request`*